app/controllers/books_controller.rb

SELECT "books".* FROM "books"
INSERT INTO "books" ("created_at", "updated_at", "title", "body", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2021-03-01 05:13:36.630924"], ["updated_at", "2021-03-01 05:13:36.630924"], ["title", "aiueo"], ["body", "aiueo"], ["user_id", 1]]
---
  def create
    @books = Book.all
  	@book = Book.new(book_params)
  	@book.user_id = current_user.id
  	if @book.save